<?php

namespace Database\Seeders;

use App\Models\Screen;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use  App\Services\LetterConverter;

class ScreenSeederTestKU extends Seeder
{

    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $converter = new LetterConverter();
        $screens = [
            ['lesson_id' => 17, 'order' => 1, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ١', 'content_type' => 'test', 'content' => 'سەردەمانێک لە دۆڵە گەشاوەکانی کوردستاندا، کە چرپەی چیا کۆنەکان لەگەڵ لێشاوی نەرمی ڕووبارەکاندا یەکدەگرنەوە، دارێکی زمانزانی کۆنی ژیر بە ناوی ڕۆشنا دەژیا. ڕۆشنا شاهیدی دابەزین و ڕۆیشتنی نەوەکان بوو، بەڵام لەگەڵ ئەوەشدا ڕەگ و ڕیشەی لە حیکمەتەکەیدا مابووەوە.بەرەبەیانێکی نەورۆز، شوانێکی گەنجی کورد بە ناوی کاروان لە ژێر لقە بەرفراوانەکانی ڕۆشنا پەنای برد. کاروان کە مەڕەکانی لە نزیکەوە دەلەوەڕین، خەونەکانی لەگەڵ دارە زمانزانەکەدا دابەش دەکرد. تامەزرۆی ئەوە بوو ببێتە شاعیر، جوانی زێدی خۆی بە وشە بنەخشێنێت.ڕۆشنا گوێی لێ بوو، گەڵاکانی وەک لاپەڕەی شیعری لەبیرکراو دەقیژاند. بە چرپە گوتی: "لە دڵی هەموو کوردێکدا شاعیرێک هەیە چاوەڕێیە بەئاگا بێتەوە".کاروان بە ئیلهام وەرگرتن لە حیکمەتی داری زمانزانی کۆن، قەڵەمەکەی هەڵگرت و دەستی کرد بە نووسین، قسەکانی وەک ئاوازەکانی مۆسیقای کوردی بوو. لە ژێر نیگاو چاودێری ڕۆشنادا، شاعیرێکی نوێی کورد سەریهەڵدا، بەیتەکانی دەنگدانەوەی ڕۆحی شێرکۆ بێکەس و جوانییەکانی نیشتمان بوو.',  'extra' => 60, 'locale' => 'ckb'],
            ['lesson_id' => 17, 'order' => 2, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ٢', 'content_type' => 'test', 'content' => 'لە ناو بازاڕە قەرەباڵغەکانی هەولێردا، گەنجێکی کتێبفرۆشی کورد بە ناوی زارا کتێبێکی نهێنی لەناو کتێبە کۆنەکانی باوکیدا دۆزییەوە، لاپەڕەکانی پڕ بوون لە ئەفسانەی لەبیرکراوی کوردی.ئێوارەیەک کە خۆر لە ژێر ئاسۆدا نوقم بوو، زارا دەستی کرد بە خوێندنەوەی پەرتووکەکە. باسی لە شوێنێکی عیرفانیی دەکرد کە لە قووڵایی چیای زاگرۆسدا شاراوەتەوە- پیرۆزگایەک کە خەونەکان تێیدا فۆرمیان گرتبوو.زارا بە پەرۆشییەوە دەستی بە گەشتەکەی کرد بە ناو شاخ و دۆڵەکاندا. لەگەڵ هەر هەنگاوێکدا هەستی بە ئامادەبوونی باوباپیرانی دەکرد کە ڕێنوێنیان دەکرد. لە کۆتاییدا گەیشتە شوێنی مەبەست کە شوێنێکی پیرۆزی نهێنی بوو.لەوێ لە نێوان سنەوبەرە چڕەکاندا لەگەڵ گۆرانی و جریوەی باڵندەکاندا، زارا ئەوەی بەدوایدا دەگەڕا، دۆزییەوە- چەقۆیەکی ئەفسوناوی کە چەند ووشەیەکی لەسەر نوسرابوو کە نهێنی ژیانیان هەڵگرتبو.نهێنییەکەی زارا کە لەلایەن زاگرۆسییەکان(کوردەکان)ەوە پاسەوانی دەکرا، زارایان فێرکرد کە پرسیارکردن و فێربوون نهێنی ژیانن و ڕێگات بۆ ڕۆشن دەکەنەوە.',  'extra' => 60, 'locale' => 'ckb'],
            ['lesson_id' => 17, 'order' => 3, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ٣', 'content_type' => 'test', 'content' => 'لە گوندێکی دابڕاوو وێراندا کە لە نێوان شاخەکاندا هەڵکەوتبوو، کچێکی گەنج بە ناوی هاژین خاوەنی دیارییەکی سەرو سروشت بوو. دەیتوانی لە زمانی باڵندەکان تێبگات. هەموو بەیانیەک لە ژێر دارێکی بەرزی گوندەکەیاندا دادەنیشت و گوێی لە گفتوگۆو مێلۆدی باڵندەکان دەگرت. ڕۆژێک کە گوێی لە ڕەوەیەک کاروان بوو، باسی دارستانێکی دووریان دەکرد کە گوڵێکی ئەفسانەیی لێیە لە سەدەیەکدا تەنها جارێک دەپشکوێت. دەگوترا هەرکەسێک ئەم گوڵە بدۆزێتەوە یەکێک لە ئاواتەکانی دێتەدی. هاژین بە پەرۆشییەوە دەستی بە گەشتەکەی کرد، بە ڕێنمایی باڵندەکان. لە ڕێگەی دارستانە چڕەکانەوە و بەسەر چەمە پێچاوپێچەکاندا، دواجار گەیشتە ئەو کانییە شاراوەیەی کە گوڵە ئەفسوناوییەکە تێیدا گەشە دەکات. هاژین بە دڵێکی پڕ لە هیواوە، ئاواتەکەی خستەڕوو- ئاواتێک بۆ یەکگرتوویی و خۆشگوزەرانی لە گوندە خۆشەویستەکەیدا. لەگەڵ گەڕانەوەی بۆ ماڵەوە، گوندەکە گۆڕانکاری بەسەردا هات. ناکۆکییەکان وەلا نران و خەڵکەکە کۆبوونەوە، ئیلهامیان لە گەشتەکەی هاژین و ئاواتەکەی بۆ یەکگرتویی گەلەکەی وەرگرت. ئەوان تێگەیشتن کە گەورەترین گەنجینەکان لە دارستانە دوورەکاندا نادۆزرێتەوە بەڵکو لەناو دڵی خۆیاندا دەدۆزرێتەوە. دیارییەکەی هاژین کە بە ڕێنمایی باڵندەکان دۆزرایەوە، گوندەکەی لەیەکتر نزیککردەوەو توانییان ڕوبەڕوی ئاڵنگارییەکان ببنەوە.',  'extra' => 60, 'locale' => 'ckb'],
            // ['lesson_id' => 17, 'order' => 4, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ٤', 'content_type' => 'test', 'content' => '',  'extra' => 60, 'locale' => 'ckb'],
            // ['lesson_id' => 17, 'order' => 5, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ٥', 'content_type' => 'test', 'content' => '',  'extra' => 60, 'locale' => 'ckb'],
            // ['lesson_id' => 17, 'order' => 6, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ٦', 'content_type' => 'test', 'content' => '',  'extra' => 60, 'locale' => 'ckb'],
            // ['lesson_id' => 17, 'order' => 7, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ٧', 'content_type' => 'test', 'content' => '',  'extra' => 60, 'locale' => 'ckb'],
            // ['lesson_id' => 17, 'order' => 8, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ٨', 'content_type' => 'test', 'content' => '',  'extra' => 60, 'locale' => 'ckb'],
            // ['lesson_id' => 17, 'order' => 9, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ٩', 'content_type' => 'test', 'content' => '',  'extra' => 60, 'locale' => 'ckb'],
            // ['lesson_id' => 17, 'order' => 10, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ١٠', 'content_type' => 'test', 'content' => '',  'extra' => 60, 'locale' => 'ckb'],
            // ['lesson_id' => 17, 'order' => 11, 'exercise_id' => 52, 'title' => 'تاقیکردنەوە - ١١', 'content_type' => 'test', 'content' => '',  'extra' => 60, 'locale' => 'ckb'],
        ];

        foreach ($screens as $screenData) {
            Screen::create($screenData);
        }
    }
}
